# NumObj

## Description
Function NumObj returns the number of objects on the referenced layer.&lt;BR&gt;

```pascal
FUNCTION NumObj(h : HANDLE) : LONGINT;
```

```python

def vs.NumObj(h):
    return LONGINT
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE|Handle to layer.|

## Version
Availability: from MiniCAD
## Category
* Layers